Documents/Requests/Soap_Getcustomerdetails_DSL_mo_23_02_2022_08_19_21_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDEGetCustomerDetails" xmlns:vfd1="http://amdocs/vfde/customer/VFDEGetCustomerDetailsInput">
    <soapenv:Header/>
    <soapenv:Body>
        <vfd:GetCustomerDetailsRequest>
            <vfd1:ROOT>
                <Event>
                    <Type>RetrieveCustomerInfo</Type>
                   <ID>44e771cd-eafb-4309-bd3a-1127065c0962</ID>
                    <CallerID>OSF</CallerID>
                    <CorrelationID>07c2203c-25d0-423c-aa75-ceec2b0093b4</CorrelationID>
                    <MessageCreationTimestamp>2022-02-23T05:58:58.372Z</MessageCreationTimestamp>
                </Event>
                <DATA>
                    <GlobalID>FN_</GlobalID>
                    <Mode>1</Mode>
                    <SourceSystemID> </SourceSystemID>
                    <Portal>{{portal}}</Portal>
                </DATA>
            </vfd1:ROOT>
        </vfd:GetCustomerDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>